Ran Plan for 9 projects:

1. dir: `infra/us-east-1/dev/rds/security-group` workspace: `infra_us-east-1_dev_rds_security-group`
1. dir: `infra/us-east-1/dev/eks/cluster` workspace: `infra_us-east-1_dev_eks_cluster`
1. dir: `infra/us-east-1/dev/eks/honeycomb` workspace: `infra_us-east-1_dev_eks_honeycomb`
1. dir: `infra/us-east-1/dev/eks/kubevela-addons` workspace: `infra_us-east-1_dev_eks_kubevela-addons`
1. dir: `infra/us-east-1/dev/eks/cluster-addons` workspace: `infra_us-east-1_dev_eks_cluster-addons`
1. dir: `infra/us-east-1/dev/vpc` workspace: `infra_us-east-1_dev_vpc`
1. dir: `infra/us-east-1/dev/rds/subnet-group` workspace: `infra_us-east-1_dev_rds_subnet-group`
1. dir: `infra/us-east-1/mgmt/peering/dev` workspace: `infra_us-east-1_mgmt_peering_dev`
1. dir: `infra/us-east-1/prod/eks/green/kubevela-addons` workspace: `infra_us-east-1_prod_eks_green_kubevela-addons`

### 1. dir: `infra/us-east-1/dev/rds/security-group` workspace: `infra_us-east-1_dev_rds_security-group`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/rds/security-group -w infra_us-east-1_dev_rds_security-group`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Frds%252Fsecurity-group%252Finfra_us-east-1_dev_rds_security-group)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/rds/security-group -w infra_us-east-1_dev_rds_security-group`

---
### 2. dir: `infra/us-east-1/dev/eks/cluster` workspace: `infra_us-east-1_dev_eks_cluster`
<details><summary>Show Output</summary>

```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
╷
│ Warning: Argument is deprecated
│ 
│   with module.eks.aws_eks_addon.this["coredns"],
│   on .terraform/modules/eks/main.tf line 392, in resource "aws_eks_addon" "this":
│  392:   resolve_conflicts        = try(each.value.resolve_conflicts, "OVERWRITE")
│ 
│ The "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
│ resource creation. Use "resolve_conflicts_on_create" and/or
│ "resolve_conflicts_on_update" instead
│ 
│ (and 2 more similar warnings elsewhere)
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/eks/cluster -w infra_us-east-1_dev_eks_cluster`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Feks%252Fcluster%252Finfra_us-east-1_dev_eks_cluster)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/eks/cluster -w infra_us-east-1_dev_eks_cluster`
</details>
No changes. Your infrastructure matches the configuration.

---
### 3. dir: `infra/us-east-1/dev/eks/honeycomb` workspace: `infra_us-east-1_dev_eks_honeycomb`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/eks/honeycomb -w infra_us-east-1_dev_eks_honeycomb`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Feks%252Fhoneycomb%252Finfra_us-east-1_dev_eks_honeycomb)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/eks/honeycomb -w infra_us-east-1_dev_eks_honeycomb`

---
### 4. dir: `infra/us-east-1/dev/eks/kubevela-addons` workspace: `infra_us-east-1_dev_eks_kubevela-addons`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # kubectl_manifest.addons["addons/crossplane.yaml"] will be updated in-place
!   resource "kubectl_manifest" "addons" {
        id                      = "/apis/core.oam.dev/v1beta1/namespaces/vela-system/applications/addon-crossplane"
        name                    = "addon-crossplane"
!       yaml_body               = (sensitive value)
!       yaml_body_parsed        = <<-EOT
            apiVersion: core.oam.dev/v1beta1
            kind: Application
            metadata:
              name: addon-crossplane
              namespace: vela-system
            spec:
              components:
              - name: crossplane
                properties:
                  chart: crossplane
                  repoType: helm
                  url: https://charts.crossplane.io/stable
                  values:
                    extraObjects:
                    - apiVersion: pkg.crossplane.io/v1alpha1
                      kind: ControllerConfig
                      metadata:
                        annotations:
                          eks.amazonaws.com/role-arn: arn:aws:iam::677160962006:role/CrossPlaneAddonRole
                          helm.sh/hook: post-install
                        name: aws-config
                      spec:
                        podSecurityContext:
                          fsGroup: 2000
                    - apiVersion: pkg.crossplane.io/v1
                      kind: Provider
                      metadata:
                        annotations:
                          helm.sh/hook: post-install
                        name: provider-aws
                      spec:
                        controllerConfigRef:
                          name: aws-config
                        package: xpkg.upbound.io/crossplane-contrib/provider-aws:v0.45.2
                    replicas: 1
+                   resourcesCrossplane:
+                     limits:
+                       cpu: 500m
+                       memory: 512Mi
                  version: 1.14.0
                type: helm
              - name: crossplane-provider-config
                properties:
                  objects:
                  - apiVersion: aws.crossplane.io/v1beta1
                    kind: ProviderConfig
                    metadata:
                      name: aws-provider
                    spec:
                      credentials:
                        source: InjectedIdentity
                type: k8s-objects
              workflow:
                steps:
                - name: apply-crossplane
                  properties:
                    component: crossplane
                  type: apply-component
                - name: wait-crds
                  properties:
                    duration: 3m
                  type: suspend
                - name: apply-crossplane-config
                  properties:
                    component: crossplane-provider-config
                  type: apply-component
        EOT
        # (13 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/eks/kubevela-addons -w infra_us-east-1_dev_eks_kubevela-addons`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Feks%252Fkubevela-addons%252Finfra_us-east-1_dev_eks_kubevela-addons)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/eks/kubevela-addons -w infra_us-east-1_dev_eks_kubevela-addons`
</details>
Plan: 0 to add, 1 to change, 0 to destroy.

---
### 5. dir: `infra/us-east-1/dev/eks/cluster-addons` workspace: `infra_us-east-1_dev_eks_cluster-addons`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/eks/cluster-addons -w infra_us-east-1_dev_eks_cluster-addons`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Feks%252Fcluster-addons%252Finfra_us-east-1_dev_eks_cluster-addons)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/eks/cluster-addons -w infra_us-east-1_dev_eks_cluster-addons`

---
### 6. dir: `infra/us-east-1/dev/vpc` workspace: `infra_us-east-1_dev_vpc`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_subnet_group.database[0] will be created
+   resource "aws_db_subnet_group" "database" {
+       arn                     = (known after apply)
+       description             = "Database subnet group for scde-dev-us-east-1"
+       id                      = (known after apply)
+       name                    = "dev-subnet-group"
+       name_prefix             = (known after apply)
+       subnet_ids              = (known after apply)
+       supported_network_types = (known after apply)
+       tags                    = {
+           "Name" = "dev-subnet-group"
        }
+       tags_all                = {
+           "Environment"  = "dev"
+           "Name"         = "dev-subnet-group"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                  = (known after apply)
    }

  # aws_route_table_association.database[0] will be created
+   resource "aws_route_table_association" "database" {
+       id             = (known after apply)
+       route_table_id = "rtb-0303dbb2e0e8365ce"
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.database[1] will be created
+   resource "aws_route_table_association" "database" {
+       id             = (known after apply)
+       route_table_id = "rtb-0303dbb2e0e8365ce"
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.database[2] will be created
+   resource "aws_route_table_association" "database" {
+       id             = (known after apply)
+       route_table_id = "rtb-0303dbb2e0e8365ce"
+       subnet_id      = (known after apply)
    }

  # aws_subnet.database[0] will be created
+   resource "aws_subnet" "database" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.50.108.0/22"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "scde-dev-us-east-1-db-us-east-1a"
        }
+       tags_all                                       = {
+           "Environment"  = "dev"
+           "Name"         = "scde-dev-us-east-1-db-us-east-1a"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                                         = "vpc-07838bb868f5b4c8c"
    }

  # aws_subnet.database[1] will be created
+   resource "aws_subnet" "database" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.50.112.0/22"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "scde-dev-us-east-1-db-us-east-1b"
        }
+       tags_all                                       = {
+           "Environment"  = "dev"
+           "Name"         = "scde-dev-us-east-1-db-us-east-1b"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                                         = "vpc-07838bb868f5b4c8c"
    }

  # aws_subnet.database[2] will be created
+   resource "aws_subnet" "database" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.50.116.0/22"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "scde-dev-us-east-1-db-us-east-1c"
        }
+       tags_all                                       = {
+           "Environment"  = "dev"
+           "Name"         = "scde-dev-us-east-1-db-us-east-1c"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                                         = "vpc-07838bb868f5b4c8c"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
!   database_route_table_association_ids        = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
!   database_subnet_arns                        = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   database_subnet_group                       = (known after apply)
+   database_subnet_group_name                  = "dev-subnet-group"
!   database_subnets                            = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
!   database_subnets_cidr_blocks                = [
+       "10.50.108.0/22",
+       "10.50.112.0/22",
+       "10.50.116.0/22",
    ]
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/vpc -w infra_us-east-1_dev_vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Fvpc%252Finfra_us-east-1_dev_vpc)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/vpc -w infra_us-east-1_dev_vpc`
</details>
Plan: 7 to add, 0 to change, 0 to destroy.

---
### 7. dir: `infra/us-east-1/dev/rds/subnet-group` workspace: `infra_us-east-1_dev_rds_subnet-group`
<details><summary>Show Output</summary>

```diff
module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.db_subnet_group.aws_db_subnet_group.this[0] must be replaced
-/+ resource "aws_db_subnet_group" "this" {
!       arn                     = "arn:aws:rds:us-east-1:677160962006:subgrp:dev-subnet-group" -> (known after apply)
!       id                      = "dev-subnet-group" -> (known after apply)
!       name                    = "dev-subnet-group" -> "rds-dev-subnet-group" # forces replacement
+       name_prefix             = (known after apply)
!       supported_network_types = [
-           "IPV4",
        ] -> (known after apply)
!       tags                    = {
!           "Name" = "dev-subnet-group" -> "rds-dev-subnet-group"
        }
!       tags_all                = {
!           "Name"         = "dev-subnet-group" -> "rds-dev-subnet-group"
            # (5 unchanged elements hidden)
        }
!       vpc_id                  = "vpc-07838bb868f5b4c8c" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!   db_subnet_group_arn                = "arn:aws:rds:us-east-1:677160962006:subgrp:dev-subnet-group" -> (known after apply)
!   db_subnet_group_id                 = "dev-subnet-group" -> (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/rds/subnet-group -w infra_us-east-1_dev_rds_subnet-group`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Frds%252Fsubnet-group%252Finfra_us-east-1_dev_rds_subnet-group)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/rds/subnet-group -w infra_us-east-1_dev_rds_subnet-group`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
### 8. dir: `infra/us-east-1/mgmt/peering/dev` workspace: `infra_us-east-1_mgmt_peering_dev`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/peering/dev -w infra_us-east-1_mgmt_peering_dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fpeering%252Fdev%252Finfra_us-east-1_mgmt_peering_dev)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/peering/dev -w infra_us-east-1_mgmt_peering_dev`

---
### 9. dir: `infra/us-east-1/prod/eks/green/kubevela-addons` workspace: `infra_us-east-1_prod_eks_green_kubevela-addons`
**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/118/infra_us-east-1_prod_eks_green_kubevela-addons/infra/us-east-1/prod/eks/green/kubevela-addons": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/118/infra_us-east-1_prod_eks_green_kubevela-addons/infra/us-east-1/prod/eks/green/kubevela-addons": 
time=2024-01-16T13:09:49Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/input-output-hk/sc-dev-platform/118/infra_us-east-1_prod_eks_green_kubevela-addons/infra/modules/eks. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/118/infra_us-east-1_prod_eks_green_kubevela-addons/infra/us-east-1/prod/eks/green/eks] 
time=2024-01-16T13:10:37Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/input-output-hk/sc-dev-platform/118/infra_us-east-1_prod_eks_green_kubevela-addons/infra/modules/kubevela-addons. Relative paths in downloaded Terraform code may not work.

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Finding gavinbunney/kubectl versions matching "~> 1.14"...
- Finding latest version of hashicorp/helm...
- Finding latest version of hashicorp/kubernetes...
- Installing hashicorp/aws v5.32.1...
- Installed hashicorp/aws v5.32.1 (signed by HashiCorp)
- Installing gavinbunney/kubectl v1.14.0...
- Installed gavinbunney/kubectl v1.14.0 (self-signed, key ID AD64217B5ADD572F)
- Installing hashicorp/helm v2.12.1...
- Installed hashicorp/helm v2.12.1 (signed by HashiCorp)
- Installing hashicorp/kubernetes v2.25.2...
- Installed hashicorp/kubernetes v2.25.2 (signed by HashiCorp)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!
data.aws_eks_cluster.cluster: Reading...
data.aws_eks_cluster.cluster: Read complete after 0s [id=scde-prod-us-east-1-green]
helm_release.cardano[0]: Refreshing state... [id=cardano]
kubernetes_secret.dex-config[0]: Refreshing state... [id=vela-system/dex-config]
kubernetes_secret.dex-connector: Refreshing state... [id=vela-system/google]
kubectl_manifest.traitdefinition_bucket_user: Refreshing state... [id=/apis/core.oam.dev/v1beta1/namespaces/vela-system/traitdefinitions/bucket-user]
data.kubectl_filename_list.manifests[0]: Reading...
kubectl_manifest.traitdefinition_resource: Refreshing state... [id=/apis/core.oam.dev/v1beta1/namespaces/vela-system/traitdefinitions/resource]
data.kubectl_filename_list.manifests[0]: Read complete after 0s [id=52aa77eeab9646437de15dcf3c6fedd6dd104bebf39e2be50238c183fa76532d]
kubectl_manifest.componentdefinition_helmrelease: Refreshing state... [id=/apis/core.oam.dev/v1beta1/namespaces/vela-system/componentdefinitions/helm]
kubectl_manifest.workflowtdefinition_build_nix_image: Refreshing state... [id=/apis/core.oam.dev/v1beta1/namespaces/vela-system/workflowstepdefinitions/build-nix-image]
kubectl_manifest.componentdefinition_kustomize: Refreshing state... [id=/apis/core.oam.dev/v1beta1/namespaces/vela-system/componentdefinitions/kustomize]
kubectl_manifest.traitdefinition_postgres_instance: Refreshing state... [id=/apis/core.oam.dev/v1beta1/namespaces/vela-system/traitdefinitions/postgres-instance]
kubectl_manifest.traitdefinition_cardano_node_connector: Refreshing state... [id=/apis/core.oam.dev/v1beta1/namespaces/vela-system/traitdefinitions/cardano-node-connector]
kubectl_manifest.componentdefinition_bucket: Refreshing state... [id=/apis/core.oam.dev/v1beta1/namespaces/vela-system/componentdefinitions/bucket]
kubernetes_manifest.traitdefinition_https_route: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # kubectl_manifest.gh-oauth[0] will be created
  + resource "kubectl_manifest" "gh-oauth" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Secret"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "gh-oauth"
      + namespace               = "marlowe"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data: (sensitive value)
            kind: Secret
            metadata:
              name: gh-oauth
              namespace: marlowe
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.iohk-ghcr-creds[0] will be created
  + resource "kubectl_manifest" "iohk-ghcr-creds" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Secret"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "iohk-ghcr-creds"
      + namespace               = "marlowe"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data: (sensitive value)
            kind: Secret
            metadata:
              name: iohk-ghcr-creds
              namespace: marlowe
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.jwt-signature[0] will be created
  + resource "kubectl_manifest" "jwt-signature" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Secret"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "jwt-signature"
      + namespace               = "marlowe"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data: (sensitive value)
            kind: Secret
            metadata:
              name: jwt-signature
              namespace: marlowe
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
╷
│ Error: Kubernetes cluster unreachable: the server has asked for the client to provide credentials
│ 
│   with helm_release.cardano[0],
│   on cardano.tf line 1, in resource "helm_release" "cardano":
│    1: resource "helm_release" "cardano" {
│ 
╵
╷
│ Error: Failed to determine GroupVersionResource for manifest
│ 
│   with kubernetes_manifest.traitdefinition_https_route,
│   on definitions.tf line 1, in resource "kubernetes_manifest" "traitdefinition_https_route":
│    1: resource "kubernetes_manifest" "traitdefinition_https_route" {
│ 
│ the server has asked for the client to provide credentials
╵
╷
│ Error: failed to create kubernetes rest client for read of resource: Unauthorized
│ 
│   with kubectl_manifest.traitdefinition_resource,
│   on definitions.tf line 27, in resource "kubectl_manifest" "traitdefinition_resource":
│   27: resource "kubectl_manifest" "traitdefinition_resource" {
│ 
╵
╷
│ Error: failed to create kubernetes rest client for read of resource: Unauthorized
│ 
│   with kubectl_manifest.traitdefinition_postgres_instance,
│   on definitions.tf line 54, in resource "kubectl_manifest" "traitdefinition_postgres_instance":
│   54: resource "kubectl_manifest" "traitdefinition_postgres_instance" {
│ 
╵
╷
│ Error: failed to create kubernetes rest client for read of resource: Unauthorized
│ 
│   with kubectl_manifest.traitdefinition_bucket_user,
│   on definitions.tf line 86, in resource "kubectl_manifest" "traitdefinition_bucket_user":
│   86: resource "kubectl_manifest" "traitdefinition_bucket_user" {
│ 
╵
╷
│ Error: failed to create kubernetes rest client for read of resource: Unauthorized
│ 
│   with kubectl_manifest.workflowtdefinition_build_nix_image,
│   on definitions.tf line 115, in resource "kubectl_manifest" "workflowtdefinition_build_nix_image":
│  115: resource "kubectl_manifest" "workflowtdefinition_build_nix_image" {
│ 
╵
╷
│ Error: failed to create kubernetes rest client for read of resource: Unauthorized
│ 
│   with kubectl_manifest.componentdefinition_bucket,
│   on definitions.tf line 139, in resource "kubectl_manifest" "componentdefinition_bucket":
│  139: resource "kubectl_manifest" "componentdefinition_bucket" {
│ 
╵
╷
│ Error: failed to create kubernetes rest client for read of resource: Unauthorized
│ 
│   with kubectl_manifest.traitdefinition_cardano_node_connector,
│   on definitions.tf line 165, in resource "kubectl_manifest" "traitdefinition_cardano_node_connector":
│  165: resource "kubectl_manifest" "traitdefinition_cardano_node_connector" {
│ 
╵
╷
│ Error: failed to create kubernetes rest client for read of resource: Unauthorized
│ 
│   with kubectl_manifest.componentdefinition_helmrelease,
│   on definitions.tf line 191, in resource "kubectl_manifest" "componentdefinition_helmrelease":
│  191: resource "kubectl_manifest" "componentdefinition_helmrelease" {
│ 
╵
╷
│ Error: failed to create kubernetes rest client for read of resource: Unauthorized
│ 
│   with kubectl_manifest.componentdefinition_kustomize,
│   on definitions.tf line 197, in resource "kubectl_manifest" "componentdefinition_kustomize":
│  197: resource "kubectl_manifest" "componentdefinition_kustomize" {
│ 
╵
╷
│ Error: Unauthorized
│ 
│   with kubernetes_secret.dex-config[0],
│   on dex.tf line 5, in resource "kubernetes_secret" "dex-config":
│    5: resource "kubernetes_secret" "dex-config" {
│ 
╵
╷
│ Error: Unauthorized
│ 
│   with kubernetes_secret.dex-connector,
│   on dex.tf line 64, in resource "kubernetes_secret" "dex-connector":
│   64: resource "kubernetes_secret" "dex-connector" {
│ 
╵
time=2024-01-16T13:11:11Z level=error msg=Terraform invocation failed in /atlantis-data/repos/input-output-hk/sc-dev-platform/118/infra_us-east-1_prod_eks_green_kubevela-addons/infra/us-east-1/prod/eks/green/kubevela-addons/.terragrunt-cache/oHc-5I2BuDNaB9OC23FajUdgmck/KHVyTiTeoxpY78u6tgHLfRYUhgs prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/118/infra_us-east-1_prod_eks_green_kubevela-addons/infra/us-east-1/prod/eks/green/kubevela-addons] 
time=2024-01-16T13:11:11Z level=error msg=1 error occurred:
	* [/atlantis-data/repos/input-output-hk/sc-dev-platform/118/infra_us-east-1_prod_eks_green_kubevela-addons/infra/us-east-1/prod/eks/green/kubevela-addons/.terragrunt-cache/oHc-5I2BuDNaB9OC23FajUdgmck/KHVyTiTeoxpY78u6tgHLfRYUhgs] exit status 1





```
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`